app/controllers/matches_controller.rb

SELECT "matches".* FROM "matches"
---
  def index
  	@matches = Match.all #Show all matches

INSERT INTO "matches" ("created_at", "match", "str_1", "str_2", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2014-11-30 16:35:08.125464"], ["match", "t"], ["str_1", "amendoim"], ["str_2", "mendoima"], ["updated_at", "2014-11-30 16:35:08.125464"]]
---
  def create
    @post = Match.new(post_params)                         #Get post params
  	@post.match = detect_anagram(@post.str_1, @post.str_2) #Compare str_1 and str_2
  	@post.save                                             #Save the strings and the result of match in the database

SELECT  "matches".* FROM "matches"  WHERE "matches"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
  	@post = Match.find(params[:id]) #Show params of post